Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV.SetGridCoordinates(System.Collections.Generic.ICollection{System.Double},System.Collections.Generic.ICollection{System.Double})
Set u and v coordinates that specify a grid on the surface.
The display of the grid is controlled by AnalysisDisplayColoredSurfaceSettings::getShowGridLines().
If AnalysisDisplayColoredSurfaceSettings::getShowGridLines() returns true and both sets are empty
then a grid will be displayed using a default spacing; if only one of the sets is non-empty, then
only the corresponding set of grid lines will be displayed, i.e. the grid will consist solely of
parallel lines at the specified coordinates.
uCoordinates:
Set of u coordinates at which to draw grid lines
vCoordinates:
Set of v coordinates at which to draw grid lines
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.UV},System.Collections.Generic.ICollection{System.Double},System.Collections.Generic.ICollection{System.Double})
Creates object from an array of two-dimensional point coordinates
points:
Array of two-dimensional point coordinates representing domain points (usually on surface)
uCoordinates:
Set of u coordinates at which to draw grid lines on the surface
vCoordinates:
Set of v coordinates at which to draw grid lines on the surface
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.UV})
Creates object from an array of two-dimensional point coordinates
points:
Array of two-dimensional point coordinates representing domain points (usually on surface)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV
Represents a set of two-dimensional point coordinates (defined usually on surface)
Since:
2011